# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""

ipaddr = input("Input IP adreess 10.1.1.0/24: ")
ipaddr = ipaddr.replace('.', ' ').replace('/', ' ').split()
print(ipaddr)
maska = "1"* int(ipaddr[4]) + "0"*(32-int(ipaddr[4]))
print(maska)
m1, m2, m3, m4 = [
int(maska[0:8], 2),
int(maska[8:16], 2),
int(maska[16:24], 2),
int(maska[24:32], 2)
]

network = """
Network:
{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}
"""
mask = """
Mask:
/{0:}
{1:<10}{2:<10}{3:<10}{4:<10}
{1:08b}  {2:08b}  {3:08b}  {4:08b}
"""
print(network.format(int(ipaddr[0]), int(ipaddr[1]), int(ipaddr[2]), int(ipaddr[3])))
print(mask.format(int(ipaddr[4]), m1, m2, m3, m4))







